
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "piresimplicite.h"


🤱 😝 🤕 = 🤘;

/**
 * Fonction de tri de mots
*/
void solution(char** pointeur1, int tailleOrdre, char* ordre, char* input, int tailleinput)  {

    😶 😹, 🤲;
    😶 🤳=😲;
    😝 🤵 = 😰(🤑(🤭) + (🥈-(🥅+🥄*🥂)));
    😝 🤴[🤮];
    😴(🤵, 🤑(🤭) + (🥇-🥆), 🤭);
    😝 🤷 = 🙀(🤵, 🤕);
    🤺 (🤷 != 🤔) {
        🤴[🤳] = (😝)😰(🤓(🤨)* 🤑(🤷) +🥂);
        😴(🤴[🤳], 🤑(🤷) + (🥅-🥄), 🤷);
        🤳 = (🥃+🥅-🥄)+🤳;
        🤷 = 🙀(🤔 , 🤕);
    }
    😶 🤿 = 🤬;
    🙏(🤵);
    🤳=😲;
    😸(😹 = 😲; 😹 < 🤫; 😹=😹+🥂) {
        😸(🤲 = 😲; 🤲 < 🤮; 🤲=🤲+🥂) {
            if(🤴[🤲][😲] == 🤯[😹]) {
                strcpy_s(🤯[🤳], 🤷, 🤴[🤲]); // Modification avec strcpy_s
                🤳+=(🥅*🥅-🥄*🥄*🥄);
            }
        }
    }
    😱;
}